{
    "name": "Juarez Culau",
    "logo_name": "juarez-culau",
    "role": "Software developer | Game developer",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>I have a background in science, but aside from my academic pursuits, I've honed my skills in software development and game design. I've worked on an exciting open-source project where I developed the MABA (Mice Automatic Behavior Analysis) tool. This bioinformatic tool utilizes deep-learning models to extract visual behavior data from mice in neuroscience research. As an Unreal Developer, I've also had the opportunity to create gameplay systems, optimize physics systems, and design 2D and 3D games using Unreal Engine 4 and 5. Additionally, I've contributed to AI development, enhancing character behaviors to create immersive gaming experiences."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<p>\nAs a Software Developer, I have experience in Python and C++ programming languages, leveraging my expertise in computer vision libraries such as OpenCV and TensorFlow. My specialized skills in computer vision and software development include:\n  <br><br>\n  - Image Processing: Applying filters, performing edge detection, and advanced image segmentation techniques to extract meaningful information from images and videos.\n  <br>\n  - Deep Learning: Designing and deploying deep learning models for computer vision tasks, utilizing frameworks like TensorFlow to solve complex problems such as image classification, object detection, and semantic segmentation.\n  <br>\n  - Software Development: Proficiency in Python and C++ enables me to develop robust and efficient software solutions, with a focus on creating high-quality code, implementing algorithms, and optimizing performance.\n</p>\n\n<p>\n  <br> Transitioning to my passion for Game Development, I possess expertise in creating captivating games using Unreal Engine 4 and Unreal Engine 5, incorporating various mechanics and features:\n  <br><br>\n  - Combat Systems: Designing engaging combat mechanics that involve player input, enemy AI, and strategic decision-making. Implementing features such as different attack types, combos, special abilities, and enemy behavior patterns.\n  <br>\n  - Character Movement and Physics: Implementing smooth and responsive character movement with precise controls, including platforming mechanics, jumping, running, and physics-based interactions.\n  <br>\n  - Game AI: Developing intelligent and challenging AI behaviors for non-player characters (NPCs), such as enemy behavior, pathfinding, decision-making, and adaptive AI. \n  <br>\n - Writing: Showcasing a strong capability for crafting immersive stories and creating compelling narratives that resonate with players and make the game be remembered. <br>\n\n\n<p>\n <br> Combining my expertise in software development and game development, I bring a unique perspective to my projects, delivering innovative solutions and captivating gameplay experiences. \n</p>\n"
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<p>\n  <br>Problem Solving: My background in science has led me to develop strong analytical skills, enabling me to understand and solve problems effectively.\n  <br><br>Adaptability: I am quick to learn, allowing me to easily adapt to different environments and technologies.\n  <br><br>Communication: With experience collaborating in teams, I excel at explaining concepts in both technical and non-technical terms. I am also adept at documenting actions in an organized manner.\n</p>"
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br>I have a strong academic background in science, which has provided me with a solid foundation in data analysis and problem-solving. Throughout my academic journey, I have had the opportunity to work on various projects, predominantly focused on biological applications. These projects involved handling large datasets and applying artificial intelligence techniques to derive meaningful insights. This experience has not only enhanced my programming skills but has also fostered my ability to tackle complex challenges with creativity and precision. \n  <br>\n  During my academic years, I embarked on a journey to explore the realm of game development, honing my skills by creating small games and demos. This hands-on experience eventually paved the way for freelance opportunities in Unreal Engine, where I had the chance to showcase my expertise.\n\nThroughout my journey, I have become adept at crafting captivating narratives that immerse players in rich storytelling. Additionally, I possess a strong command over creating intricate mechanics and designing AI behaviors that enhance the overall gameplay experience."
                    },
                    "interests": {
                        "title": "interests",
                        "description": "<p>\n  I am committed to continuously improving my skills in software development and game creation. The advancements in Artificial Intelligence have revolutionized the automation of numerous tasks, presenting new breakthrough opportunities in development. Furthermore, the frequent release of cutting-edge technologies in game development for Unreal Engine has made it even more achievable to create unforgettable experiences.\n  <br><br>\n  Embracing these advancements, I have developed a fervent passion for learning and implementing these technologies. It is my utmost goal to stay updated with the latest trends, ensuring that I can leverage them to deliver exceptional results in software development and game creation.\n</p>"
                    },
                    "curriculum": {
                        "title": "curriculum",
                        "description": "<h2>Juarez Culau Batista Pires</h2>\n\n<p>\n  Av Dr Ari Coelho de Oliveira, 478<br>\n  Terenos, MS<br>\n  Cell: +55(67)98457-4549<br>\n  Email: juarezcbp@hotmail.com<br>\n  GitHub: <a href=\"https://github.com/JuarezCulau\">https://github.com/JuarezCulau</a><br><br>\n</p>\n\n<h3>EDUCATION</h3>\n\n<p><br>\n  Bachelor of Science (B.Sc), Biomedicine, Dom Bosco Catholic University, 2019-2022<br><br>\n</p>\n\n<p>\n  Associate of Applied Science (A.AS), Computer Technician, Pronatec, 2016-2017<br><br>\n</p>\n\n<p>\n  Training in the Use of Experimental Laboratory Animals at Dom Bosco Catholic University, 2019<br><br>\n</p>\n\n<p>\n  University Extension Course at University of São Paulo, 2022<br>\n  <em>DNA Damage Responses: Implications in aging and cancer</em><br><br>\n</p>\n\n<h3>WORK EXPERIENCE</h3>\n\n<p><br>\n  Software Development, Open-Source Project, 2022-2023<br>\n  Creation of MABA (Mice Automatic Behavior Analysis): Open-Source bioinformatic tool to extract visual behavior data from mice in neuroscience, leveraging deep learning models<br><br>\n</p>\n\n<p>\n  Unreal Developer, Freelancer, 2023<br>\n  Developed gameplay systems, optimized physics systems, and created 2D and 3D games using Unreal Engine 4 and 5, while also contributing to AI development for enhanced character behaviors<br><br>\n</p>\n\n<h3>RESEARCH EXPERIENCE</h3>\n\n<p><br>\n  Research Project, Dom Bosco Catholic University - UCDB, 2019<br>\n  Evaluation of the effects on memory and anxiety of the hydroalcoholic extract of Heteropterys tomentosa<br><br>\n</p>\n\n<p>\n  Scientific Initiation, Dom Bosco Catholic University - UCDB, 2019-2020<br>\n  Cellular and Molecular Mechanisms of Synthetic Peptides in a Cellular Model of Neuroinflammation<br><br>\n</p>\n\n<p>\n  Scientific Initiation, Dom Bosco Catholic University - UCDB, 2020-2021<br>\n  Evaluation of Molecular Markers in Breast Cancer Using Data from Genetic Expression<br><br>\n</p>\n\n<p>\n  Research Project, University of São Paulo - USP, 2022-2023<br>\n  Investigation of the effects of Bocaiúva pulp oil (Acrocomia aculeata) on anxiety-like behavior and memory extinction in mice<br><br>\n</p>\n\n<p>\n  1° Health Data Analysis Hackathon at ITPS (University of São Paulo - USP)<br>\n  Participated in a hackathon and contributed to the development of a methodology for organizing medical examinations at no cost to users, leveraging epidemiological data voluntarily provided by the population as a whole<br><br>\n</p>\n\n<h3>PRESENTATIONS</h3>\n\n<p><br>\n  Culau, Juarez (2020). “IL21R, IFNG and FOXP3 Genes Correlated in the Th17 Pathway in Breast Cancer.” Presented at the III Symposium on Immunology of the MidWest (SICO)<br><br>\n</p>\n\n<p>\n  Culau, Juarez (2021). “Exacerbated Expression of IL21R, IFNG and FOXP3 in the Th17 Pathway of Breast Cancer.” Presented at Next Frontiers to Cure Cancer<br><br>\n</p>\n\n<p>\n  Culau, Juarez (2021). “Identification of Genes Associated with Apoptosis, Differentiation and Cell Cycle Pathways in Breast Cancer.” Presented at the XLV Annual Meeting of the Brazilian Society of Immunology<br><br>\n</p>\n\n<p>\n  Culau, Juarez (2021). “Identification of Genes Associated with Apoptosis, Differentiation and Cell Cycle Pathways in Breast Cancer.” Presented at the Brazilian Congress of Genetics<br><br>\n</p>\n\n<h3>GRANTS AND FELLOWSHIPS</h3>\n\n<p><br>\n  100% Scholarship, UCDB Challenge (Dom Bosco Catholic University, 2018)<br><br>\n</p>\n\n<h3>AWARDS AND HONORS</h3>\n\n<p><br>\n  Best Scientific Work in the Category of Biotechnology Process at Conecte, 2021<br><br>\n</p>\n\n<h3>SKILL SET</h3>\n\n<p><br>\n  Bioinformatics<br>\n  C++ and Python Programming<br>\n  Tensorflow and OpenCV<br>\n  Computer Vision<br>\n  Unreal Engine<br>\n Narrative Writing<br><br>\n</p>\n\n<h3>LANGUAGES</h3>\n\n<p><br>\n  Portuguese: Native<br>\n  English: Advanced<br><br>\n</p>"
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "sports": {
                        "title": "sports",
                        "description": "<br>I have a deep passion for sports, particularly calisthenics and climbing, which captivate my enthusiasm and drive for physical challenges."
                    },
                    "favorite-games": {
                        "title": "favorite-games",
                        "description": "<br><p>\n  Skyrim holds a special place in my heart, as I have dedicated countless hours exploring and replaying the game, often enhanced by mods that bring new dimensions to the experience.\n  <br><br>\n  Moreover, Kingdom Come Deliverance captivated me with its remarkable realism, immersing me in a historically accurate world. No Man's Sky provided me with awe-inspiring experiences, as its vast universe and exploration possibilities ignited my imagination.\n  <br><br>\n  Additionally, X4 Foundation stands out for its intricate systems and advanced artificial intelligence, creating a dynamic and immersive space simulation experience.\n</p>"
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacts",
            "sources": {
                "email": "juarezcbp@hotmail.com",
                "phone": "+55(67)98457-4549"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "JuarezCulau"
            },
            "facebook": {
                "title": "Facebook profile",
                "url": "https://facebook.com/",
                "user": "juarez.culaubatistapires"
            },
            "twitter": {
                "title": "Twitter account",
                "url": "https://twitter.com/",
                "user": "CulauJuarez"
            }
        },
            "find_me_also_in": {
                "title": "find-me-also-in",
                "sources": {
                    "instagram": {
                        "title": "Instagram account",
                        "url": "https://instagram.com/",
                        "user": "juarezcbp"
                    }
                }
            }

    },
    "gists": {
        "1": "83861a67e377633ee8368df01ee3a355",
        "2": "694c1f32332788a2ac7f37b09e5aa40e"
    },
    "projects": {
        "1": {
            "title": "MABA",
            "description": "MABA (Mice Automatic Behavior Analysis) is a powerful bioinformatic tool designed to automate the analysis of visual behavior in mice and rats.",
            "img": "/images/projects/maba.png",
            "tech": ["TensorFlow", "OpenCV", "Numpy", "Python"],
            "url": "https://github.com/JuarezCulau/MABA"
        },
        "2": {
            "title": "_ai-resources",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ai-resources.png",
            "tech": ["Gatsby"],
            "url": "https://github.com/"
        },
        "3": {
            "title": "_worldmap",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/worldmap.png",
            "tech": ["Angular"],
            "url": "https://github.com/"
        },
        "4": {
            "title": "_ui-animations",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ui-animations.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "5": {
            "title": "_tetris-game",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/tetris-game.png",
            "tech": ["React"],
            "url": "https://github.com/"
        },
        "6": {
            "title": "_ethereum",
            "description": "Duis aute irure dolor in velit esse cillum dolore.",
            "img": "/images/projects/ethereum.png",
            "tech": ["Vue"],
            "url": "https://github.com/"
        }
    }
}